ejercicios_js.org
#+title: Ejercicios JavaScript

* Objetivos
:PROPERTIES:
:CUSTOM_ID: objetivos
:END:
Probad estos ejemplos y tratad de responder a las preguntas. Si os
atascáis con lo que hace una función, buscad en Internet la función
acompañado de "mdn".

* Valores booleanos en JavaScript
:PROPERTIES:
:CUSTOM_ID: valores-booleanos-en-javascript
:END:
En JavaScript cualquier valor puede considerarse verdadero o falso según
el contexto. Por ejemplo, el =0= es considerado =false= y cualquier
número distinto de =0= es =true=:

#+begin_src js
const v = 0; // después de esta prueba, cambia el valor de v por otro número.
!!v; // la doble negación al comienzo lo convierte en booleano.
#+end_src

Descubre qué valores son ciertos y cuales falsos para todos los tipos:
números, cadenas, objetos, funciones y undefined.

* Expresiones booleanas en JavaScript
:PROPERTIES:
:CUSTOM_ID: expresiones-booleanas-en-javascript
:END:
En JavaScript, las expresiones booleanas son /vagas/, esto significa que
en cuanto sabemos lo que va a valer la expresión, dejamos de evaluar.
Por ejemplo, ¿qué crees que le pasará a la siguiente expressión?

#+begin_src js
const hero = { name: 'Link', weapon: null };
console.log('Hero weapon power is:', hero.weapon.power);
#+end_src

Pero, ¿y ahora?

#+begin_src js
const hero = { name: 'Link', weapon: null };
if (hero.weapon && hero.weapon.power) {
  console.log('Hero weapon power is:', hero.weapon.power);
} else {
  console.log('The hero has no weapon.');
}
#+end_src

En caso de expresiones =&&= (/and/ o /y/), la evaluación termina tan
pronto como encontramos un término falso.

En caso de expresiones =||= (/or/ u /o/), la evaluación termina tan
pronto como encontramos un término verdadero.

* El resultado de las expresiones booleanas
:PROPERTIES:
:CUSTOM_ID: el-resultado-de-las-expresiones-booleanas
:END:
Contra el sentido común, el resultado de una expresión booleana no es un
booleano sino el último término evaluado. Recuerda que la evaluación es
/vaga/ y dejamos de evaluar tan pronto como podemos determinar el
resultado de la expresión. Con esto en cuenta, trata de predecir el
resultado de las siguientes expresiones:

#+begin_src js
let v;
function noop() { return; };

1 && true && { name: 'Link' };
[] && null && "Spam!";
null || v || noop || true;
null || v || void "Eggs!" || 0;
#+end_src

* Parámetros por defecto
:PROPERTIES:
:CUSTOM_ID: parámetros-por-defecto
:END:
Puedes ver una aplicación real de lo anterior en esta función para
rellenar números. En JavaScript, los
parámetros omitidos tienen el valor especial =undefined= que es falso (por ejemplo, un ~if~ lo considera un valor ~false~).

#+begin_src js
function pad(target, targetLengthIn, fillIn) {
  let result = target.toString();
  const targetLength = targetLengthIn || result.length + 1;
  const fill = fillIn || '0';
  while (result.length < targetLength) {
    result = fill + result;
  }
  return result;
}

// intenta predecir el resultado de las siguientes llamadas
pad(3);
pad(2, 5);
pad(2, 5, '*');
#+end_src

Sin embargo, si no necesitamos una lógica muy compleja, también se pueden usar parámetros por defecto. Es posible incluir expresiones en los parámetros:

#+begin_src js
function pad(target, targetLength = target.toString().length + 1, fill = '0') {
  let result = target.toString();
  
  while (result.length < targetLength) {
    result = fill + result;
  }
  return result;
}

console.log(pad(5));
console.log(pad(2, 5));
console.log(pad(2, 5, '*'));
#+end_src


# * Buenas prácticas en el diseño de APIs
# :PROPERTIES:
# :CUSTOM_ID: buenas-prácticas-en-el-diseño-de-apis
# :END:
# Hemos dicho muchas veces que el estado no se debería exponer pero
# siempre acabamos enseñando este tipo de modelado para los puntos:

# #+begin_src js
# const p = { x: 5, y: 5 };

# function scale(point, factor) {
#   point.x = point.x * factor;
#   point.y = point.y * factor;
#   return p;
# }

# scale(p, 10);
# #+end_src

# La implementación correcta sería:

# #+begin_src js
# const p = {
#   _x: 5,
#   _y: 5,
#   getX: function () {
#     return this._x;
#   },
#   getY: function () {
#     return this._y;
#   },
#   setX: function (v) {
#     this._x = v;
#   },
#   setY: function (v) {
#     this._y = v;
#   }
# };

# function scale(point, factor) {
#   point.setX(point.getX() * factor);
#   point.setY(point.getY() * factor);
#   return p;
# }

# scale(p, 10);
# #+end_src

# Pero reconozcámoslo, escribir esto es un rollo soberano.

* Propiedades computadas al rescate
:PROPERTIES:
:CUSTOM_ID: propiedades-computadas-al-rescate
:END:
JavaScript permite definir un tipo especial de propiedades llamadas
normalmente /propiedades computadas/ de esta guisa:

#+begin_src js
const p = {
  _x: 5,
  _y: 5,
  get x() {
    return this._x;
  },
  get y() {
    return this._y;
  },
  set x(v) {
    this._x = v;
  },
  set y(v) {
    this._y = v;
  }
};

function scale(point, factor) {
  point.x = point.x * factor;
  point.y = point.y * factor;
  return p;
}

scale(p, 10);
#+end_src

Escribirlo sigue siendo tedioso, pero utilizarlo es mucho más claro. Así, si ahora
decides que sería mejor exponer el nombre de los ejes en mayúscula,
puedes hacer:

#+begin_src js
const p = {
  _x: 5,
  _y: 5,
  get X() {
    return this._x;
  },
  get Y() {
    return this._y;
  },
  set X(v) {
    this._x = v;
  },
  set Y(v) {
    this._y = v;
  }
};

function scale(point, factor) {
  point.X = point.X * factor;
  point.Y = point.Y * factor;
  return p;
}

scale(p, 10);
#+end_src

Esta sintaxis funciona para objetos, pero también para clases:

#+begin_src js
class P {
    constructor(){
        this.x = 5
        this.y = 5
    }
    get x() {
        return this._x;
    }
    get y() {
        return this._y;
    }
    set x(v) {
        this._x = v;
    }
    set y(v) {
        this._y = v;
    }
}

const p1 = new P()
console.log(p1.x)
#+end_src


-------------------

¿Se te ocurre la manera de hacer que una propiedad pueda ser de solo
lectura? Es decir, que su valor no pueda cambiarse (asumiendo que el
usuario no accederá a las propiedades que comiencen por '_').

Si quisieras añadir una propiedad a un objeto ya existente tendrías que
utilizar
[[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/defineProperty][=Object.defineProperty()=]]:

#+begin_src js
const point = {};
Object.defineProperty(point, '_x', { value: 5 });
Object.defineProperty(point, '_y', { value: 5 });
Object.defineProperty(point, 'x', {
  get: function () {
    return this._x;
  },
  set: function (v) {
    this._x = v;
  }
});
Object.defineProperty(point, 'y', {
  get: function () {
    return this._y;
  },
  set: function (v) {
    this._y = v;
  }
});
point; // no se observan propiedades...
point.x; // ...pero aquí están.
point.y;
#+end_src

¿Te atreves a decir por qué cuando inspeccionamos el objeto no aparecen
sus propiedades? ¿Cómo podrías arreglarlo? ¿Cómo harías para que sólo se
vieran las propiedades que son parte de la API?

No te lances a usar =Object.defineProperty()= si no tienes *muy claro*
qué significan los términos *configurable*, *enumerable* y *writable*.

