ejercicios_js.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-02-11 mar 12:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ejercicios JavaScript</title>
<meta name="author" content="Carlos León" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Ejercicios JavaScript</h1>

<div id="outline-container-objetivos" class="outline-2">
<h2 id="objetivos"><span class="section-number-2">1.</span> Objetivos</h2>
<div class="outline-text-2" id="text-objetivos">
<p>
Probad estos ejemplos y tratad de responder a las preguntas. Si os
atascáis con lo que hace una función, buscad en Internet la función
acompañado de "mdn".
</p>
</div>
</div>

<div id="outline-container-valores-booleanos-en-javascript" class="outline-2">
<h2 id="valores-booleanos-en-javascript"><span class="section-number-2">2.</span> Valores booleanos en JavaScript</h2>
<div class="outline-text-2" id="text-valores-booleanos-en-javascript">
<p>
En JavaScript cualquier valor puede considerarse verdadero o falso según
el contexto. Por ejemplo, el <code>0</code> es considerado <code>false</code> y cualquier
número distinto de <code>0</code> es <code>true</code>:
</p>

<div class="org-src-container">
<pre class="src src-js">const v = 0; // después de esta prueba, cambia el valor de v por otro número.
!!v; // la doble negación al comienzo lo convierte en booleano.
</pre>
</div>

<p>
Descubre qué valores son ciertos y cuales falsos para todos los tipos:
números, cadenas, objetos, funciones y undefined.
</p>
</div>
</div>

<div id="outline-container-expresiones-booleanas-en-javascript" class="outline-2">
<h2 id="expresiones-booleanas-en-javascript"><span class="section-number-2">3.</span> Expresiones booleanas en JavaScript</h2>
<div class="outline-text-2" id="text-expresiones-booleanas-en-javascript">
<p>
En JavaScript, las expresiones booleanas son <i>vagas</i>, esto significa que
en cuanto sabemos lo que va a valer la expresión, dejamos de evaluar.
Por ejemplo, ¿qué crees que le pasará a la siguiente expressión?
</p>

<div class="org-src-container">
<pre class="src src-js">const hero = { name: 'Link', weapon: null };
console.log('Hero weapon power is:', hero.weapon.power);
</pre>
</div>

<p>
Pero, ¿y ahora?
</p>

<div class="org-src-container">
<pre class="src src-js">const hero = { name: 'Link', weapon: null };
if (hero.weapon &amp;&amp; hero.weapon.power) {
  console.log('Hero weapon power is:', hero.weapon.power);
} else {
  console.log('The hero has no weapon.');
}
</pre>
</div>

<p>
En caso de expresiones <code>&amp;&amp;</code> (<i>and</i> o <i>y</i>), la evaluación termina tan
pronto como encontramos un término falso.
</p>

<p>
En caso de expresiones <code>||</code> (<i>or</i> u <i>o</i>), la evaluación termina tan
pronto como encontramos un término verdadero.
</p>
</div>
</div>

<div id="outline-container-el-resultado-de-las-expresiones-booleanas" class="outline-2">
<h2 id="el-resultado-de-las-expresiones-booleanas"><span class="section-number-2">4.</span> El resultado de las expresiones booleanas</h2>
<div class="outline-text-2" id="text-el-resultado-de-las-expresiones-booleanas">
<p>
Contra el sentido común, el resultado de una expresión booleana no es un
booleano sino el último término evaluado. Recuerda que la evaluación es
<i>vaga</i> y dejamos de evaluar tan pronto como podemos determinar el
resultado de la expresión. Con esto en cuenta, trata de predecir el
resultado de las siguientes expresiones:
</p>

<div class="org-src-container">
<pre class="src src-js">let v;
function noop() { return; };

1 &amp;&amp; true &amp;&amp; { name: 'Link' };
[] &amp;&amp; null &amp;&amp; "Spam!";
null || v || noop || true;
null || v || void "Eggs!" || 0;
</pre>
</div>
</div>
</div>

<div id="outline-container-parámetros-por-defecto" class="outline-2">
<h2 id="parámetros-por-defecto"><span class="section-number-2">5.</span> Parámetros por defecto</h2>
<div class="outline-text-2" id="text-parámetros-por-defecto">
<p>
Puedes ver una aplicación real de lo anterior en esta función para
rellenar números. En JavaScript, los
parámetros omitidos tienen el valor especial <code>undefined</code> que es falso (por ejemplo, un <code>if</code> lo considera un valor <code>false</code>).
</p>

<div class="org-src-container">
<pre class="src src-js">function pad(target, targetLengthIn, fillIn) {
  let result = target.toString();
  const targetLength = targetLengthIn || result.length + 1;
  const fill = fillIn || '0';
  while (result.length &lt; targetLength) {
    result = fill + result;
  }
  return result;
}

// intenta predecir el resultado de las siguientes llamadas
pad(3);
pad(2, 5);
pad(2, 5, '*');
</pre>
</div>

<p>
Sin embargo, si no necesitamos una lógica muy compleja, también se pueden usar parámetros por defecto. Es posible incluir expresiones en los parámetros:
</p>

<div class="org-src-container">
<pre class="src src-js">function pad(target, targetLength = target.toString().length + 1, fill = '0') {
  let result = target.toString();

  while (result.length &lt; targetLength) {
    result = fill + result;
  }
  return result;
}

console.log(pad(5));
console.log(pad(2, 5));
console.log(pad(2, 5, '*'));
</pre>
</div>
</div>
</div>

<div id="outline-container-propiedades-computadas-al-rescate" class="outline-2">
<h2 id="propiedades-computadas-al-rescate"><span class="section-number-2">6.</span> Propiedades computadas al rescate</h2>
<div class="outline-text-2" id="text-propiedades-computadas-al-rescate">
<p>
JavaScript permite definir un tipo especial de propiedades llamadas
normalmente <i>propiedades computadas</i> de esta guisa:
</p>

<div class="org-src-container">
<pre class="src src-js">const p = {
  _x: 5,
  _y: 5,
  get x() {
    return this._x;
  },
  get y() {
    return this._y;
  },
  set x(v) {
    this._x = v;
  },
  set y(v) {
    this._y = v;
  }
};

function scale(point, factor) {
  point.x = point.x * factor;
  point.y = point.y * factor;
  return p;
}

scale(p, 10);
</pre>
</div>

<p>
Escribirlo sigue siendo tedioso, pero utilizarlo es mucho más claro. Así, si ahora
decides que sería mejor exponer el nombre de los ejes en mayúscula,
puedes hacer:
</p>

<div class="org-src-container">
<pre class="src src-js">const p = {
  _x: 5,
  _y: 5,
  get X() {
    return this._x;
  },
  get Y() {
    return this._y;
  },
  set X(v) {
    this._x = v;
  },
  set Y(v) {
    this._y = v;
  }
};

function scale(point, factor) {
  point.X = point.X * factor;
  point.Y = point.Y * factor;
  return p;
}

scale(p, 10);
</pre>
</div>

<p>
Esta sintaxis funciona para objetos, pero también para clases:
</p>

<div class="org-src-container">
<pre class="src src-js">class P {
    constructor(){
        this.x = 5
        this.y = 5
    }
    get x() {
        return this._x;
    }
    get y() {
        return this._y;
    }
    set x(v) {
        this._x = v;
    }
    set y(v) {
        this._y = v;
    }
}

const p1 = new P()
console.log(p1.x)
</pre>
</div>


<hr />

<p>
¿Se te ocurre la manera de hacer que una propiedad pueda ser de solo
lectura? Es decir, que su valor no pueda cambiarse (asumiendo que el
usuario no accederá a las propiedades que comiencen por '_').
</p>

<p>
Si quisieras añadir una propiedad a un objeto ya existente tendrías que
utilizar
<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/defineProperty"><code>Object.defineProperty()</code></a>:
</p>

<div class="org-src-container">
<pre class="src src-js">const point = {};
Object.defineProperty(point, '_x', { value: 5 });
Object.defineProperty(point, '_y', { value: 5 });
Object.defineProperty(point, 'x', {
  get: function () {
    return this._x;
  },
  set: function (v) {
    this._x = v;
  }
});
Object.defineProperty(point, 'y', {
  get: function () {
    return this._y;
  },
  set: function (v) {
    this._y = v;
  }
});
point; // no se observan propiedades...
point.x; // ...pero aquí están.
point.y;
</pre>
</div>

<p>
¿Te atreves a decir por qué cuando inspeccionamos el objeto no aparecen
sus propiedades? ¿Cómo podrías arreglarlo? ¿Cómo harías para que sólo se
vieran las propiedades que son parte de la API?
</p>

<p>
No te lances a usar <code>Object.defineProperty()</code> si no tienes <b>muy claro</b>
qué significan los términos <b>configurable</b>, <b>enumerable</b> y <b>writable</b>.
</p>
</div>
</div>
