ejercicios_js.org
* Usando funciones como si fueran métodos
:PROPERTIES:
:CUSTOM_ID: usando-funciones-como-si-fueran-métodos
:END:
Hemos visto que cualquier función puede usarse como un método si se
referencia como una propiedad de un objeto y entonces se llama. Pero lo
cierto es que también podemos hacer que una función cualquiera, sin
estar referenciada desde una propiedad, pueda ser usada como el método
de un objeto si indicamos explícitamente cual es el objeto destinatario.
Esto puede hacerse con
[[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Function/apply][=.apply()=]]
y con
[[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Function/call][=.call()=]].

#+begin_src js
const ship = { name: 'Death Star' };

function fire(shot) {
  console.log(this.name + ' is firing: ' + shot.toUpperCase() + '!!!');
}

ship.fire; // ¿qué crees que será esto?
fire.apply(ship, ['pichium']);
fire.call(ship, 'pañum');
#+end_src

¿Cuál es la diferencia entre =.apply()= y =.call()=?

* Propiedades dinámicas
:PROPERTIES:
:CUSTOM_ID: propiedades-dinámicas
:END:
La notación corchete para acceder a las propiedades de un objeto es
especialmente útil para acceder a propiedades de manera genérica. Por
ejemplo, imagina el siguiente código:

#+begin_src js
const hero = {
  name: 'Link',
  hp: 10,
  stamina: 10,
  weapon: { name: 'sword', effect: { hp: -2 } }
};
const enemy = {
  name: 'Ganondorf',
  hp: 20,
  stamina: 5,
  weapon: { name: 'wand', effect: { hp: -1, stamina: -5 } }
};

function attack(character, target) {
  if (character.stamina > 0) {
    console.log(character.name + ' uses ' + character.weapon.name + '!');
    applyEffect(character.weapon.effect, target);
    character.stamina--;
  } else {
    console.log(character.name + ' is too tired to attack!');
  }
}

function applyEffect(effect, target) {
  // Obtiene los nombres de las propiedades del objeto. Búscalo en la MDN.
  const propertyNames = Object.keys(effect);
  for (let i = 0; i < propertyNames.length; i++) {
    const name = propertyNames[i];
    target[name] += effect[name];
  }
}

attack(hero, enemy);
attack(enemy, hero);
attack(hero, enemy);
attack(enemy, hero);
attack(hero, enemy);
#+end_src

¿Podrías modificar el efecto del arma del héroe para incapacitar al
enemigo pero no matarlo ni dañarlo? Intenta hacerlo sin reescribir el
ejemplo entero.

* Objetos como algo más que objetos
:PROPERTIES:
:CUSTOM_ID: objetos-como-algo-más-que-objetos
:END:
Los objetos de JavaScript no solo sirven para modelar los objetos de la
programación orientada a objetos sino que permiten realizar
clasificaciones por nombre. Un histograma, es decir un conteo de un
conjunto con repeticiones, es un ejemplo clásico de la utilidad de un
objeto JavaScript:

#+begin_src js
function wordHistogram(text) {
  const wordList = text.split(' ');
  const histogram = {};
  for (let i = 0; i < wordList.length; i++) {
    const word = wordList[i];
    if (!histogram.hasOwnProperty(word)) {
      histogram[word] = 0;
    }
    histogram[word]++;
  }
  return histogram;
}
#+end_src

Prueba a usar la función por ti mismo.

Lo que JavaScript llama objetos se conoce en otros lenguajes de
programación como mapas, hashmaps o diccionarios y a los nombres de las
propiedades se los llama /claves/.

¿Puedes pensar en al menos una aplicacion más?

