ejercicios_js.html

<div id="outline-container-usando-funciones-como-si-fueran-métodos" class="outline-2">
<h2 id="usando-funciones-como-si-fueran-métodos"><span class="section-number-2">7.</span> Usando funciones como si fueran métodos</h2>
<div class="outline-text-2" id="text-usando-funciones-como-si-fueran-métodos">
<p>
Hemos visto que cualquier función puede usarse como un método si se
referencia como una propiedad de un objeto y entonces se llama. Pero lo
cierto es que también podemos hacer que una función cualquiera, sin
estar referenciada desde una propiedad, pueda ser usada como el método
de un objeto si indicamos explícitamente cual es el objeto destinatario.
Esto puede hacerse con
<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Function/apply"><code>.apply()</code></a>
y con
<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Function/call"><code>.call()</code></a>.
</p>

<div class="org-src-container">
<pre class="src src-js">const ship = { name: 'Death Star' };

function fire(shot) {
  console.log(this.name + ' is firing: ' + shot.toUpperCase() + '!!!');
}

ship.fire; // ¿qué crees que será esto?
fire.apply(ship, ['pichium']);
fire.call(ship, 'pañum');
</pre>
</div>

<p>
¿Cuál es la diferencia entre <code>.apply()</code> y <code>.call()</code>?
</p>
</div>
</div>

<div id="outline-container-propiedades-dinámicas" class="outline-2">
<h2 id="propiedades-dinámicas"><span class="section-number-2">8.</span> Propiedades dinámicas</h2>
<div class="outline-text-2" id="text-propiedades-dinámicas">
<p>
La notación corchete para acceder a las propiedades de un objeto es
especialmente útil para acceder a propiedades de manera genérica. Por
ejemplo, imagina el siguiente código:
</p>

<div class="org-src-container">
<pre class="src src-js">const hero = {
  name: 'Link',
  hp: 10,
  stamina: 10,
  weapon: { name: 'sword', effect: { hp: -2 } }
};
const enemy = {
  name: 'Ganondorf',
  hp: 20,
  stamina: 5,
  weapon: { name: 'wand', effect: { hp: -1, stamina: -5 } }
};

function attack(character, target) {
  if (character.stamina &gt; 0) {
    console.log(character.name + ' uses ' + character.weapon.name + '!');
    applyEffect(character.weapon.effect, target);
    character.stamina--;
  } else {
    console.log(character.name + ' is too tired to attack!');
  }
}

function applyEffect(effect, target) {
  // Obtiene los nombres de las propiedades del objeto. Búscalo en la MDN.
  const propertyNames = Object.keys(effect);
  for (let i = 0; i &lt; propertyNames.length; i++) {
    const name = propertyNames[i];
    target[name] += effect[name];
  }
}

attack(hero, enemy);
attack(enemy, hero);
attack(hero, enemy);
attack(enemy, hero);
attack(hero, enemy);
</pre>
</div>

<p>
¿Podrías modificar el efecto del arma del héroe para incapacitar al
enemigo pero no matarlo ni dañarlo? Intenta hacerlo sin reescribir el
ejemplo entero.
</p>
</div>
</div>

<div id="outline-container-objetos-como-algo-más-que-objetos" class="outline-2">
<h2 id="objetos-como-algo-más-que-objetos"><span class="section-number-2">9.</span> Objetos como algo más que objetos</h2>
<div class="outline-text-2" id="text-objetos-como-algo-más-que-objetos">
<p>
Los objetos de JavaScript no solo sirven para modelar los objetos de la
programación orientada a objetos sino que permiten realizar
clasificaciones por nombre. Un histograma, es decir un conteo de un
conjunto con repeticiones, es un ejemplo clásico de la utilidad de un
objeto JavaScript:
</p>

<div class="org-src-container">
<pre class="src src-js">function wordHistogram(text) {
  const wordList = text.split(' ');
  const histogram = {};
  for (let i = 0; i &lt; wordList.length; i++) {
    const word = wordList[i];
    if (!histogram.hasOwnProperty(word)) {
      histogram[word] = 0;
    }
    histogram[word]++;
  }
  return histogram;
}
</pre>
</div>

<p>
Prueba a usar la función por ti mismo.
</p>

<p>
Lo que JavaScript llama objetos se conoce en otros lenguajes de
programación como mapas, hashmaps o diccionarios y a los nombres de las
propiedades se los llama <i>claves</i>.
</p>

<p>
¿Puedes pensar en al menos una aplicacion más?
</p>
</div>
</div>
