ejercicios_js.org
* Funciones como parámetros
:PROPERTIES:
:CUSTOM_ID: funciones-como-parámetros
:END:
Las listas de JavaScript tiene algunos métodos que aceptan funciones
como parámetros, por ejemplo
[[https://developer.mozilla.org/es/docs/Web/JavaScript/Referencia/Objetos_globales/Array/forEach][=.forEach()=]].
De hecho es común encontrar =.forEach()= cuando se tiene la certeza de
que se van a recorrer *todos* los elementos de una lista.

#+begin_src js
function wordHistogram(text) {
  const wordList = text.split(' ');
  const histogram = {};
  wordList.forEach(function (word) {
    if (!histogram.hasOwnProperty(word)) {
      histogram[word] = 0;
    }
    histogram[word]++;
  });
  return histogram;
}

const poem = 'Todo pasa y todo queda, ' +
           'pero lo nuestro es pasar, ' +
           'pasar haciendo caminos, ' +
           'caminos sobre la mar';

wordHistogram(poem);
#+end_src

El resultado no es correcto porque al separar las palabras por los
espacios estamos dejando caracteres que no son palabras como parte de
ellas. Podemos arreglarlo si en vez de partir el texto por los espacios
usamos una
[[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Regular_Expressions][expresión
regular]] para partir el texto por los límites de las palabras:

#+begin_src js
function wordHistogram(text) {
  const wordList = text.split(/\b/); // Eso entre / / es una expresión regular.
  const histogram = {};
  wordList.forEach(function (word) {
    if (!histogram.hasOwnProperty(word)) {
      histogram[word] = 0;
    }
    histogram[word]++;
  });
  return histogram;
}

const poem = 'Todo pasa y todo queda, ' +
           'pero lo nuestro es pasar, ' +
           'pasar haciendo caminos, ' +
           'caminos sobre la mar';

wordHistogram(poem);
#+end_src

Pero ahora tenemos cosas que no son palabras (como espacios y comas).
Podemos filtrar una lista con
[[https://developer.mozilla.org/es/docs/Web/JavaScript/Referencia/Objetos_globales/Array/filter][=.filter()=]]:

#+begin_src js
function isEven(n) { return n % 2 === 0; }
[1, 2, 3, 4, 5, 6].filter(isEven);
#+end_src

Y así quitar lo que no sean palabras:

#+begin_src js
function isWord(candidate) {
  return /\w+/.test(candidate);
}

function wordHistogram(text) {
  let wordList = text.split(/\b/);
  wordList = wordList.filter(isWord);
  const histogram = {};

  wordList.forEach(function (word) {
    if (!histogram.hasOwnProperty(word)) {
      histogram[word] = 0;
    }
    histogram[word]++;
  });
  return histogram;
}

const poem = 'Todo pasa y todo queda, ' +
           'pero lo nuestro es pasar, ' +
           'pasar haciendo caminos, ' +
           'caminos sobre la mar';

wordHistogram(poem);
#+end_src

También deberíamos normalizar las palabras (pasarlas a minúsculas por
ejemplo) para no encontrarnos con entradas distintas en el histograma
para la misma palabra. Para transformar una lista en otra lista de los
mismos elementos, usamos
[[https://developer.mozilla.org/es/docs/Web/JavaScript/Referencia/Objetos_globales/Array/map][=.map()=]].

#+begin_src js
function isWord(candidate) {
  return /\w+/.test(candidate);
}

function toLowerCase(word) {
  return word.toLowerCase();
}

function wordHistogram(text) {
  let wordList = text.split(/\b/);
  wordList = wordList.filter(isWord);
  wordList = wordList.map(toLowerCase);
  const histogram = {};

  wordList.forEach(function (word) {
    if (!histogram.hasOwnProperty(word)) {
      histogram[word] = 0;
    }
    histogram[word]++;
  });
  return histogram;
}

const poem = 'Todo pasa y todo queda, ' +
           'pero lo nuestro es pasar, ' +
           'pasar haciendo caminos, ' +
           'caminos sobre la mar';

wordHistogram(poem);
#+end_src

Una última función nos permite transformar una lista en un sólo valor.
Esto es precisamente el histograma, una clasificación de todos los
valores de la lista. Esta transformación se consigue mediante
[[https://developer.mozilla.org/es/docs/Web/JavaScript/Referencia/Objetos_globales/Array/reduce][=.reduce()=]]:

#+begin_src js
function isWord(candidate) {
  return /\w+/.test(candidate);
}

function toLowerCase(word) {
  return word.toLowerCase();
}

function buildHistogram(inProgressHistogram, word) {
  if (!inProgressHistogram.hasOwnProperty(word)) {
    inProgressHistogram[word] = 0;
  }
  inProgressHistogram[word]++;
  return inProgressHistogram;
}

function wordHistogram(text) {
  const emptyHistogram = {};
  return text.split(/\b/)
             .filter(isWord)
             .map(toLowerCase)
             .reduce(buildHistogram, emptyHistogram);
}

const poem = 'Todo pasa y todo queda, ' +
           'pero lo nuestro es pasar, ' +
           'pasar haciendo caminos, ' +
           'caminos sobre la mar';

wordHistogram(poem);
#+end_src

* Número variables de parámetros
:PROPERTIES:
:CUSTOM_ID: número-variables-de-parámetros
:END:
Fíjate en esto:

#+begin_src js
console.log('I\'m', 'Ziltoid');
console.log('I\'m', 'Ziltoid,', 'the', 'Omniscient');
Math.max(1);
Math.max(1, 2);
Math.max(1, 2, 3);
#+end_src

Como puedes ver, la función acepta un número cualquiera de variables.
Podemos hacer los mismo gracias a la variable implícita =arguments=.

#+begin_src js
function f() {
  console.log('Número de argumentos pasados:', arguments.length);
  console.log('Argumentos:', arguments);
}
f();
f(1);
f('a', {});
f(function () {}, [], undefined);
#+end_src

También es posible usar "parámetros rest":

#+begin_src js
function f(...args) {
  console.log('Argumentos:', args);
}
#+end_src

Busca la información sobre argumentos variables en la [[https://developer.mozilla.org/es/docs/Web/JavaScript/Reference/Functions/rest_parameters][MDN]]. ¡Te hará falta!

* Decoradores
:PROPERTIES:
:CUSTOM_ID: decoradores
:END:
Aparte de devolverse como parámetros, las funciones pueden ser devueltas
desde otras funciones. Considera el siguiente ejemplo:

#+begin_src js
function newLog(label) {
  return function(value) {
    console.log(label + ':', value);
  }
}
#+end_src

Esta función crea funciones que llamarán a =console.log()= pero con una
etiqueta delante. Podríamos crear métodos =_log()= por clase, cada uno
con un prefijo y así distinguir unos logs de otros.

Sin embargo, advierte el siguiente comportamiento:

#+begin_src js
const log1 = newLog('Default');
const log2 = newLog('Ziltoid');

const p = { x: 1, y: 10 };
log1(p);
log2(p);
log1('Greetings', 'humans!');
#+end_src

¿Cual es el problema? ¿Por qué no funciona el último ejemplo?

Para hacer que funcione, tendríamos que llamar a =console.log()= con un
número de parámetros que no sabemos a priori. Podemos usar =arguments=,
no obstante:

#+begin_src js
function newLog(label) {
  return function() {
    // ¿Por qué tenemos que hacer esto?
    const args = Array.prototype.slice.call(arguments);
    args.splice(0, 0, label + ':');
    console.log.apply(console, args);
  }
}

const log1 = newLog('Default');
const log2 = newLog('Ziltoid');

const p = { x: 1, y: 10 };
log1(p);
log2(p);
log1('Greetings', 'humans!');
#+end_src

¿Podrías decir qué hace cada línea en la función =newLog()=?

