ejercicios_js.html

<div id="outline-container-funciones-como-parámetros" class="outline-2">
<h2 id="funciones-como-parámetros"><span class="section-number-2">10.</span> Funciones como parámetros</h2>
<div class="outline-text-2" id="text-funciones-como-parámetros">
<p>
Las listas de JavaScript tiene algunos métodos que aceptan funciones
como parámetros, por ejemplo
<a href="https://developer.mozilla.org/es/docs/Web/JavaScript/Referencia/Objetos_globales/Array/forEach"><code>.forEach()</code></a>.
De hecho es común encontrar <code>.forEach()</code> cuando se tiene la certeza de
que se van a recorrer <b>todos</b> los elementos de una lista.
</p>

<div class="org-src-container">
<pre class="src src-js">function wordHistogram(text) {
  const wordList = text.split(' ');
  const histogram = {};
  wordList.forEach(function (word) {
    if (!histogram.hasOwnProperty(word)) {
      histogram[word] = 0;
    }
    histogram[word]++;
  });
  return histogram;
}

const poem = 'Todo pasa y todo queda, ' +
           'pero lo nuestro es pasar, ' +
           'pasar haciendo caminos, ' +
           'caminos sobre la mar';

wordHistogram(poem);
</pre>
</div>

<p>
El resultado no es correcto porque al separar las palabras por los
espacios estamos dejando caracteres que no son palabras como parte de
ellas. Podemos arreglarlo si en vez de partir el texto por los espacios
usamos una
<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Regular_Expressions">expresión
regular</a> para partir el texto por los límites de las palabras:
</p>

<div class="org-src-container">
<pre class="src src-js">function wordHistogram(text) {
  const wordList = text.split(/\b/); // Eso entre / / es una expresión regular.
  const histogram = {};
  wordList.forEach(function (word) {
    if (!histogram.hasOwnProperty(word)) {
      histogram[word] = 0;
    }
    histogram[word]++;
  });
  return histogram;
}

const poem = 'Todo pasa y todo queda, ' +
           'pero lo nuestro es pasar, ' +
           'pasar haciendo caminos, ' +
           'caminos sobre la mar';

wordHistogram(poem);
</pre>
</div>

<p>
Pero ahora tenemos cosas que no son palabras (como espacios y comas).
Podemos filtrar una lista con
<a href="https://developer.mozilla.org/es/docs/Web/JavaScript/Referencia/Objetos_globales/Array/filter"><code>.filter()</code></a>:
</p>

<div class="org-src-container">
<pre class="src src-js">function isEven(n) { return n % 2 === 0; }
[1, 2, 3, 4, 5, 6].filter(isEven);
</pre>
</div>

<p>
Y así quitar lo que no sean palabras:
</p>

<div class="org-src-container">
<pre class="src src-js">function isWord(candidate) {
  return /\w+/.test(candidate);
}

function wordHistogram(text) {
  let wordList = text.split(/\b/);
  wordList = wordList.filter(isWord);
  const histogram = {};

  wordList.forEach(function (word) {
    if (!histogram.hasOwnProperty(word)) {
      histogram[word] = 0;
    }
    histogram[word]++;
  });
  return histogram;
}

const poem = 'Todo pasa y todo queda, ' +
           'pero lo nuestro es pasar, ' +
           'pasar haciendo caminos, ' +
           'caminos sobre la mar';

wordHistogram(poem);
</pre>
</div>

<p>
También deberíamos normalizar las palabras (pasarlas a minúsculas por
ejemplo) para no encontrarnos con entradas distintas en el histograma
para la misma palabra. Para transformar una lista en otra lista de los
mismos elementos, usamos
<a href="https://developer.mozilla.org/es/docs/Web/JavaScript/Referencia/Objetos_globales/Array/map"><code>.map()</code></a>.
</p>

<div class="org-src-container">
<pre class="src src-js">function isWord(candidate) {
  return /\w+/.test(candidate);
}

function toLowerCase(word) {
  return word.toLowerCase();
}

function wordHistogram(text) {
  let wordList = text.split(/\b/);
  wordList = wordList.filter(isWord);
  wordList = wordList.map(toLowerCase);
  const histogram = {};

  wordList.forEach(function (word) {
    if (!histogram.hasOwnProperty(word)) {
      histogram[word] = 0;
    }
    histogram[word]++;
  });
  return histogram;
}

const poem = 'Todo pasa y todo queda, ' +
           'pero lo nuestro es pasar, ' +
           'pasar haciendo caminos, ' +
           'caminos sobre la mar';

wordHistogram(poem);
</pre>
</div>

<p>
Una última función nos permite transformar una lista en un sólo valor.
Esto es precisamente el histograma, una clasificación de todos los
valores de la lista. Esta transformación se consigue mediante
<a href="https://developer.mozilla.org/es/docs/Web/JavaScript/Referencia/Objetos_globales/Array/reduce"><code>.reduce()</code></a>:
</p>

<div class="org-src-container">
<pre class="src src-js">function isWord(candidate) {
  return /\w+/.test(candidate);
}

function toLowerCase(word) {
  return word.toLowerCase();
}

function buildHistogram(inProgressHistogram, word) {
  if (!inProgressHistogram.hasOwnProperty(word)) {
    inProgressHistogram[word] = 0;
  }
  inProgressHistogram[word]++;
  return inProgressHistogram;
}

function wordHistogram(text) {
  const emptyHistogram = {};
  return text.split(/\b/)
             .filter(isWord)
             .map(toLowerCase)
             .reduce(buildHistogram, emptyHistogram);
}

const poem = 'Todo pasa y todo queda, ' +
           'pero lo nuestro es pasar, ' +
           'pasar haciendo caminos, ' +
           'caminos sobre la mar';

wordHistogram(poem);
</pre>
</div>
</div>
</div>

<div id="outline-container-número-variables-de-parámetros" class="outline-2">
<h2 id="número-variables-de-parámetros"><span class="section-number-2">11.</span> Número variables de parámetros</h2>
<div class="outline-text-2" id="text-número-variables-de-parámetros">
<p>
Fíjate en esto:
</p>

<div class="org-src-container">
<pre class="src src-js">console.log('I\'m', 'Ziltoid');
console.log('I\'m', 'Ziltoid,', 'the', 'Omniscient');
Math.max(1);
Math.max(1, 2);
Math.max(1, 2, 3);
</pre>
</div>

<p>
Como puedes ver, la función acepta un número cualquiera de variables.
Podemos hacer los mismo gracias a la variable implícita <code>arguments</code>.
</p>

<div class="org-src-container">
<pre class="src src-js">function f() {
  console.log('Número de argumentos pasados:', arguments.length);
  console.log('Argumentos:', arguments);
}
f();
f(1);
f('a', {});
f(function () {}, [], undefined);
</pre>
</div>

<p>
También es posible usar "parámetros rest":
</p>

<div class="org-src-container">
<pre class="src src-js">function f(...args) {
  console.log('Argumentos:', args);
}
</pre>
</div>

<p>
Busca la información sobre argumentos variables en la <a href="https://developer.mozilla.org/es/docs/Web/JavaScript/Reference/Functions/rest_parameters">MDN</a>. ¡Te hará falta!
</p>
</div>
</div>

<div id="outline-container-decoradores" class="outline-2">
<h2 id="decoradores"><span class="section-number-2">12.</span> Decoradores</h2>
<div class="outline-text-2" id="text-decoradores">
<p>
Aparte de devolverse como parámetros, las funciones pueden ser devueltas
desde otras funciones. Considera el siguiente ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-js">function newLog(label) {
  return function(value) {
    console.log(label + ':', value);
  }
}
</pre>
</div>

<p>
Esta función crea funciones que llamarán a <code>console.log()</code> pero con una
etiqueta delante. Podríamos crear métodos <code>_log()</code> por clase, cada uno
con un prefijo y así distinguir unos logs de otros.
</p>

<p>
Sin embargo, advierte el siguiente comportamiento:
</p>

<div class="org-src-container">
<pre class="src src-js">const log1 = newLog('Default');
const log2 = newLog('Ziltoid');

const p = { x: 1, y: 10 };
log1(p);
log2(p);
log1('Greetings', 'humans!');
</pre>
</div>

<p>
¿Cual es el problema? ¿Por qué no funciona el último ejemplo?
</p>

<p>
Para hacer que funcione, tendríamos que llamar a <code>console.log()</code> con un
número de parámetros que no sabemos a priori. Podemos usar <code>arguments</code>,
no obstante:
</p>

<div class="org-src-container">
<pre class="src src-js">function newLog(label) {
  return function() {
    // ¿Por qué tenemos que hacer esto?
    const args = Array.prototype.slice.call(arguments);
    args.splice(0, 0, label + ':');
    console.log.apply(console, args);
  }
}

const log1 = newLog('Default');
const log2 = newLog('Ziltoid');

const p = { x: 1, y: 10 };
log1(p);
log2(p);
log1('Greetings', 'humans!');
</pre>
</div>

<p>
¿Podrías decir qué hace cada línea en la función <code>newLog()</code>?
</p>
</div>
</div>
