ejercicios_js.org
* Asincronía y closures
:PROPERTIES:
:CUSTOM_ID: asincronía-y-closures
:END:
Carga el siguiente código:

#+begin_src js
function scheduleTasks(count) {
  for(let i = 1; i <= count; i++) {
    setTimeout(function () {
      console.log('Executing task', i);
    }, i * 1000);
  }
}
#+end_src

Trata de predecir qué pasará al ejecutar el siguiente código:

#+begin_src js
scheduleTasks(5);
#+end_src

¿Hace lo que esperabas? Si no es así, ¿por qué? ¿cómo lo arreglarías?
Pista: necesitas la función
[[https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_objects/Function/bind][=.bind()=]].

* Eventos y métodos
:PROPERTIES:
:CUSTOM_ID: eventos-y-métodos
:END:
Hay veces en las que debemos llamar a un método de un objeto cuando
ocurra algo. Por ejemplo, supón que el método avanzar de un supuesto
objeto debe llamarse en un intervalo de tiempo. Pongamos cada segundo:

#+begin_src js
const obj = {
  x: 10,
  y: 2,
  advance: function () {
    this.y += 2;
    console.log('Ahora Y vale', this.y);
  }
};

const id = setInterval(obj.advance, 1 * 1000);
#+end_src

Este ejemplo falla porque en la última línea *no estamos llamando* a la
función sino solo pasándola como parámetro. La función =setInterval()=
no tiene idea del destinatario del mensaje y por tanto no puede llamar a
la función como si fuera un método.

Podemos arreglarlo con =bind()= pero antes para el intervalo con:

#+begin_src js
clearInterval(id);
#+end_src

Ahora podemos solucionarlo con:

#+begin_src js
const id = setInterval(obj.advance.bind(obj), 1 * 1000);
#+end_src

* La función =bind()=
:PROPERTIES:
:CUSTOM_ID: la-función-bind
:END:
A estas alturas ya deberías saber cómo funciona =bind()= o qué hace. Si
aun no lo tienes claro, búscalo en la MDN.

La tarea es la siguiente: crea una función =bind()= que simule el
comportamiento del método de las funciones =.bind()=. Como se pide una
función y no un método, el primer parámetro será la función. Así pues,
en vez de usarse así:

#+begin_src js
function die(sides) {
  const result = Math.floor(Math.random() * sides) + 1;
  this.history.push(result);
  return result;
}
const obj = { history: [] };
const d20 = die.bind(obj, 20);
d20();
#+end_src

La usaremos de esta otra forma:

#+begin_src js
function die(sides) {
  const result = Math.floor(Math.random() * sides) + 1;
  this.history.push(result);
  return result;
}
const obj = { history: [] };
const d20 = bind(die, obj, 20); // fíjate en que ahora die es el primer parámetro
d20();
#+end_src
