ejercicios_js.html

<div id="outline-container-asincronía-y-closures" class="outline-2">
<h2 id="asincronía-y-closures"><span class="section-number-2">13.</span> Asincronía y closures</h2>
<div class="outline-text-2" id="text-asincronía-y-closures">
<p>
Carga el siguiente código:
</p>

<div class="org-src-container">
<pre class="src src-js">function scheduleTasks(count) {
  for(let i = 1; i &lt;= count; i++) {
    setTimeout(function () {
      console.log('Executing task', i);
    }, i * 1000);
  }
}
</pre>
</div>

<p>
Trata de predecir qué pasará al ejecutar el siguiente código:
</p>

<div class="org-src-container">
<pre class="src src-js">scheduleTasks(5);
</pre>
</div>

<p>
¿Hace lo que esperabas? Si no es así, ¿por qué? ¿cómo lo arreglarías?
Pista: necesitas la función
<a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_objects/Function/bind"><code>.bind()</code></a>.
</p>
</div>
</div>

<div id="outline-container-eventos-y-métodos" class="outline-2">
<h2 id="eventos-y-métodos"><span class="section-number-2">14.</span> Eventos y métodos</h2>
<div class="outline-text-2" id="text-eventos-y-métodos">
<p>
Hay veces en las que debemos llamar a un método de un objeto cuando
ocurra algo. Por ejemplo, supón que el método avanzar de un supuesto
objeto debe llamarse en un intervalo de tiempo. Pongamos cada segundo:
</p>

<div class="org-src-container">
<pre class="src src-js">const obj = {
  x: 10,
  y: 2,
  advance: function () {
    this.y += 2;
    console.log('Ahora Y vale', this.y);
  }
};

const id = setInterval(obj.advance, 1 * 1000);
</pre>
</div>

<p>
Este ejemplo falla porque en la última línea <b>no estamos llamando</b> a la
función sino solo pasándola como parámetro. La función <code>setInterval()</code>
no tiene idea del destinatario del mensaje y por tanto no puede llamar a
la función como si fuera un método.
</p>

<p>
Podemos arreglarlo con <code>bind()</code> pero antes para el intervalo con:
</p>

<div class="org-src-container">
<pre class="src src-js">clearInterval(id);
</pre>
</div>

<p>
Ahora podemos solucionarlo con:
</p>

<div class="org-src-container">
<pre class="src src-js">const id = setInterval(obj.advance.bind(obj), 1 * 1000);
</pre>
</div>
</div>
</div>

<div id="outline-container-la-función-bind" class="outline-2">
<h2 id="la-función-bind"><span class="section-number-2">15.</span> La función <code>bind()</code></h2>
<div class="outline-text-2" id="text-la-función-bind">
<p>
A estas alturas ya deberías saber cómo funciona <code>bind()</code> o qué hace. Si
aun no lo tienes claro, búscalo en la MDN.
</p>

<p>
La tarea es la siguiente: crea una función <code>bind()</code> que simule el
comportamiento del método de las funciones <code>.bind()</code>. Como se pide una
función y no un método, el primer parámetro será la función. Así pues,
en vez de usarse así:
</p>

<div class="org-src-container">
<pre class="src src-js">function die(sides) {
  const result = Math.floor(Math.random() * sides) + 1;
  this.history.push(result);
  return result;
}
const obj = { history: [] };
const d20 = die.bind(obj, 20);
d20();
</pre>
</div>

<p>
La usaremos de esta otra forma:
</p>

<div class="org-src-container">
<pre class="src src-js">function die(sides) {
  const result = Math.floor(Math.random() * sides) + 1;
  this.history.push(result);
  return result;
}
const obj = { history: [] };
const d20 = bind(die, obj, 20); // fíjate en que ahora die es el primer parámetro
d20();
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Carlos León</p>
<p class="date">Created: 2025-02-11 mar 12:57</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
